РП/src/Catalogs/УчетныеПолитикиОрганизаций/УчетныеПолитикиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеПолитикиОрганизаций</name>
  <attributes>
    <name>МетодОценкиСтоимостиТоваров</name>
    <type>
      <types>EnumRef.МетодыОценкиСтоимостиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.СистемыНалогообложения</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетГотовойПродукцииПоПлановойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводкиПоРаботникам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьРезервОтпусковБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодНачисленияРезерваОтпусков</name>
    <type>
      <types>EnumRef.МетодыНачисленияРезервовОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>НормативОтчисленийВРезервОтпусков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредельнаяВеличинаОтчисленийВРезервОтпусков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемыеКлассыСчетовРасходов</name>
    <type>
      <types>EnumRef.КлассыСчетовРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПлательщикаЕдиногоНалога</name>
    <type>
      <types>EnumRef.ГруппыПлательщиковЕдиногоНалога</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияОСтатусеПлательщикаНалогов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалогНаПрибыльБезКорректировокФинансовогоРезультата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСуммуДооценокОСВСоставНераспределеннойПрибыли</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Enums/МетодыНачисленияРезервовОтпусков/МетодыНачисленияРезервовОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыНачисленияРезервовОтпусков</name>
  <enumValues>
    <name>МетодОбязательств</name>
  </enumValues>
  <enumValues>
    <name>НормативныйМетод</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/МетодыОценкиСтоимостиТоваров/МетодыОценкиСтоимостиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыОценкиСтоимостиТоваров</name>
  <enumValues>
    <name>СредняяЗаМесяц</name>
  </enumValues>
  <enumValues>
    <name>ФИФОВзвешеннаяОценка</name>
  </enumValues>
  <enumValues>
    <name>ФИФОСкользящаяОценка</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/СистемыНалогообложения/СистемыНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СистемыНалогообложения</name>
  <enumValues>
    <name>НалогНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыльИНДС</name>
  </enumValues>
  <enumValues>
    <name>ЕдиныйНалог</name>
  </enumValues>
  <enumValues>
    <name>ЕдиныйНалогИНДС</name>
  </enumValues>
  <enumValues>
    <name>Неплательщик</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/КлассыСчетовРасходов/КлассыСчетовРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КлассыСчетовРасходов</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Класс8</name>
  </enumValues>
  <enumValues>
    <name>Класс9</name>
  </enumValues>
  <enumValues>
    <name>Класс8и9</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/УчетныеПолитикиОрганизаций/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	//++ НЕ УТ
	НормативныйМетодНачисленияРезерваОтпусков = Объект.МетодНачисленияРезерваОтпусков = Перечисления.МетодыНачисленияРезервовОтпусков.НормативныйМетод;
	//-- НЕ УТ
	
	УстановитьВидимостьЭлементов();
	
// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
// Конец СтандартныеПодсистемы.Свойства

// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Оповестить("Запись_УчетныеПолитикиОрганизаций", Новый Структура, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

// СтандартныеПодсистемы.Свойства 
Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
	ОбновитьЭлементыДополнительныхРеквизитов();
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
КонецЕсли;
// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    //++ НЕ УТ
    ПроверитьКлассыСчетовРасходов(Объект.ИспользуемыеКлассыСчетовРасходов);
    //-- НЕ УТ
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СистемаНалогообложенияПриИзменении(Элемент)
	
	
	УстановитьВидимостьЭлементов();
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры


&НаКлиенте
Процедура ФормироватьРезервОтпусковБУПриИзменении(Элемент)
	
	//++ НЕ УТ
	Если Объект.ФормироватьРезервОтпусковБУ И Объект.МетодНачисленияРезерваОтпусков
			= ПредопределенноеЗначение("Перечисление.МетодыНачисленияРезервовОтпусков.МетодОбязательств") Тогда
		Объект.НормативОтчисленийВРезервОтпусков = 0;
		Объект.ПредельнаяВеличинаОтчисленийВРезервОтпусков = 0;
	КонецЕсли;
	//-- НЕ УТ
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры


&НаКлиенте
Процедура МетодНачисленияРезерваОтпусковПриИзменении(Элемент)

	//++ НЕ УТ
	НормативныйМетодНачисленияРезерваОтпусков = Объект.МетодНачисленияРезерваОтпусков = ПредопределенноеЗначение("Перечисление.МетодыНачисленияРезервовОтпусков.НормативныйМетод");
	Если Не НормативныйМетодНачисленияРезерваОтпусков Тогда
		Объект.НормативОтчисленийВРезервОтпусков = 0;
		Объект.ПредельнаяВеличинаОтчисленийВРезервОтпусков = 0;
	КонецЕсли;
	//-- НЕ УТ
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры


&НаКлиенте
Процедура МетодОценкиСтоимостиТоваровПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ОбщегоНазначенияУТКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	
	Если ПолучитьФункциональнуюОпцию("УправлениеТорговлей") Тогда
		Элементы.ГруппаРезервы.Видимость = Ложь;
		Элементы.ГруппаБухгалтерскийУчет.Видимость = Ложь;
		Элементы.ГруппаНалогНаПрибыль.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПартионныйУчет") Тогда	
		ЭлементСписка = Элементы.МетодОценкиСтоимостиТоваров.СписокВыбора.НайтиПоЗначению(
						Перечисления.МетодыОценкиСтоимостиТоваров.ФИФОСкользящаяОценка);
		Если ЭлементСписка <> Неопределено Тогда
			Элементы.МетодОценкиСтоимостиТоваров.СписокВыбора.Удалить(ЭлементСписка);
		КонецЕсли;
	КонецЕсли;
	
	
	Элементы.ГруппаОценочныеОбязательстваИРезервыОтпусков.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплатыУТ");
	
	ПлательщикЕдиногоНалога = (Объект.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.ЕдиныйНалог")) ИЛИ 
		(Объект.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.ЕдиныйНалогИНДС"));
	Элементы.ГруппаЕдиныйНалог.Видимость = ПлательщикЕдиногоНалога;

	//++ НЕ УТ
	ПлательщикНалогаНаПрибыль = (Объект.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.НалогНаПрибыль")) ИЛИ 
		(Объект.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.НалогНаПрибыльИНДС"));
	Элементы.ГруппаНалогНаПрибыль.Видимость = ПлательщикНалогаНаПрибыль;
	//-- НЕ УТ
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	
	Элементы.МетодНачисленияРезерваОтпусков.Доступность                 = Объект.ФормироватьРезервОтпусковБУ;
	
	//++ НЕ УТ
	Элементы.ГруппаПараметрыНормативногоМетода.Доступность = Объект.ФормироватьРезервОтпусковБУ И НормативныйМетодНачисленияРезерваОтпусков;
	
	Элементы.ГруппаЕжемесячныйПроцент.Доступность = Объект.ФормироватьРезервОтпусковБУ И НормативныйМетодНачисленияРезерваОтпусков;
	
	Элементы.ГруппаПредельнаяВеличина.Доступность = Объект.ФормироватьРезервОтпусковБУ И НормативныйМетодНачисленияРезерваОтпусков;
	//-- НЕ УТ
	
КонецПроцедуры


// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()

	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);

КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

//++ НЕ УТ
&НаСервере
Процедура ПроверитьКлассыСчетовРасходов(ИспользуемыеКлассыСчетовРасходов)
    
	ТекстПредупреждения = НСтр("ru='Использование только 8-го класса счетов после 01.01.2020 запрещено Инструкцией 291.
|Не будет заполнен раздел I Отчета о финансовых результатах!';uk='Використання лише 8-го класу рахунків після 01.01.2020 заборонено Інструкцією 291.
|Не буде заповнений розділ I Звіту про фінансові результати!'");
    
    Если ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8 Тогда 
		Сообщить(ТекстПредупреждения);	
    КонецЕсли;	
    
КонецПроцедуры
//-- НЕ УТ

#КонецОбласти
